zephyrproject-rtos/hal_microchip/pic32cxsg/mplabx/pic32cxsg/include/pic32cxsg41/component/oscctrl.h
#define OSCCTRL_STATUS_XOSCRDY0_Pos           _UINT32_(0)                                          /* (OSCCTRL_STATUS) XOSC 0 Ready Position */
#define OSCCTRL_STATUS_XOSCRDY0_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCRDY0_Pos)       /* (OSCCTRL_STATUS) XOSC 0 Ready Mask */
#define OSCCTRL_STATUS_XOSCRDY0(value)        (OSCCTRL_STATUS_XOSCRDY0_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCRDY0_Pos)) /* Assigment of value for XOSCRDY0 in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCRDY1_Pos           _UINT32_(1)                                          /* (OSCCTRL_STATUS) XOSC 1 Ready Position */
#define OSCCTRL_STATUS_XOSCRDY1_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCRDY1_Pos)       /* (OSCCTRL_STATUS) XOSC 1 Ready Mask */
#define OSCCTRL_STATUS_XOSCRDY1(value)        (OSCCTRL_STATUS_XOSCRDY1_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCRDY1_Pos)) /* Assigment of value for XOSCRDY1 in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCFAIL0_Pos          _UINT32_(2)                                          /* (OSCCTRL_STATUS) XOSC 0 Clock Failure Detector Position */
#define OSCCTRL_STATUS_XOSCFAIL0_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCFAIL0_Pos)      /* (OSCCTRL_STATUS) XOSC 0 Clock Failure Detector Mask */
#define OSCCTRL_STATUS_XOSCFAIL0(value)       (OSCCTRL_STATUS_XOSCFAIL0_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCFAIL0_Pos)) /* Assigment of value for XOSCFAIL0 in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCFAIL1_Pos          _UINT32_(3)                                          /* (OSCCTRL_STATUS) XOSC 1 Clock Failure Detector Position */
#define OSCCTRL_STATUS_XOSCFAIL1_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCFAIL1_Pos)      /* (OSCCTRL_STATUS) XOSC 1 Clock Failure Detector Mask */
#define OSCCTRL_STATUS_XOSCFAIL1(value)       (OSCCTRL_STATUS_XOSCFAIL1_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCFAIL1_Pos)) /* Assigment of value for XOSCFAIL1 in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCCKSW0_Pos          _UINT32_(4)                                          /* (OSCCTRL_STATUS) XOSC 0 Clock Switch Position */
#define OSCCTRL_STATUS_XOSCCKSW0_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCCKSW0_Pos)      /* (OSCCTRL_STATUS) XOSC 0 Clock Switch Mask */
#define OSCCTRL_STATUS_XOSCCKSW0(value)       (OSCCTRL_STATUS_XOSCCKSW0_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCCKSW0_Pos)) /* Assigment of value for XOSCCKSW0 in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_XOSCCKSW1_Pos          _UINT32_(5)                                          /* (OSCCTRL_STATUS) XOSC 1 Clock Switch Position */
#define OSCCTRL_STATUS_XOSCCKSW1_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_XOSCCKSW1_Pos)      /* (OSCCTRL_STATUS) XOSC 1 Clock Switch Mask */
#define OSCCTRL_STATUS_XOSCCKSW1(value)       (OSCCTRL_STATUS_XOSCCKSW1_Msk & (_UINT32_(value) << OSCCTRL_STATUS_XOSCCKSW1_Pos)) /* Assigment of value for XOSCCKSW1 in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLRDY_Pos            _UINT32_(8)                                          /* (OSCCTRL_STATUS) DFLL Ready Position */
#define OSCCTRL_STATUS_DFLLRDY_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLRDY_Pos)        /* (OSCCTRL_STATUS) DFLL Ready Mask */
#define OSCCTRL_STATUS_DFLLRDY(value)         (OSCCTRL_STATUS_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLOOB_Pos            _UINT32_(9)                                          /* (OSCCTRL_STATUS) DFLL Out Of Bounds Position */
#define OSCCTRL_STATUS_DFLLOOB_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLOOB_Pos)        /* (OSCCTRL_STATUS) DFLL Out Of Bounds Mask */
#define OSCCTRL_STATUS_DFLLOOB(value)         (OSCCTRL_STATUS_DFLLOOB_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLOOB_Pos)) /* Assigment of value for DFLLOOB in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLLCKF_Pos           _UINT32_(10)                                         /* (OSCCTRL_STATUS) DFLL Lock Fine Position */
#define OSCCTRL_STATUS_DFLLLCKF_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLLCKF_Pos)       /* (OSCCTRL_STATUS) DFLL Lock Fine Mask */
#define OSCCTRL_STATUS_DFLLLCKF(value)        (OSCCTRL_STATUS_DFLLLCKF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLLCKF_Pos)) /* Assigment of value for DFLLLCKF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLLCKC_Pos           _UINT32_(11)                                         /* (OSCCTRL_STATUS) DFLL Lock Coarse Position */
#define OSCCTRL_STATUS_DFLLLCKC_Msk           (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLLCKC_Pos)       /* (OSCCTRL_STATUS) DFLL Lock Coarse Mask */
#define OSCCTRL_STATUS_DFLLLCKC(value)        (OSCCTRL_STATUS_DFLLLCKC_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLLCKC_Pos)) /* Assigment of value for DFLLLCKC in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DFLLRCS_Pos            _UINT32_(12)                                         /* (OSCCTRL_STATUS) DFLL Reference Clock Stopped Position */
#define OSCCTRL_STATUS_DFLLRCS_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DFLLRCS_Pos)        /* (OSCCTRL_STATUS) DFLL Reference Clock Stopped Mask */
#define OSCCTRL_STATUS_DFLLRCS(value)         (OSCCTRL_STATUS_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLL0LCKR_Pos          _UINT32_(16)                                         /* (OSCCTRL_STATUS) DPLL0 Lock Rise Position */
#define OSCCTRL_STATUS_DPLL0LCKR_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_DPLL0LCKR_Pos)      /* (OSCCTRL_STATUS) DPLL0 Lock Rise Mask */
#define OSCCTRL_STATUS_DPLL0LCKR(value)       (OSCCTRL_STATUS_DPLL0LCKR_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLL0LCKR_Pos)) /* Assigment of value for DPLL0LCKR in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLL0LCKF_Pos          _UINT32_(17)                                         /* (OSCCTRL_STATUS) DPLL0 Lock Fall Position */
#define OSCCTRL_STATUS_DPLL0LCKF_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_DPLL0LCKF_Pos)      /* (OSCCTRL_STATUS) DPLL0 Lock Fall Mask */
#define OSCCTRL_STATUS_DPLL0LCKF(value)       (OSCCTRL_STATUS_DPLL0LCKF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLL0LCKF_Pos)) /* Assigment of value for DPLL0LCKF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLL0TO_Pos            _UINT32_(18)                                         /* (OSCCTRL_STATUS) DPLL0 Timeout Position */
#define OSCCTRL_STATUS_DPLL0TO_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DPLL0TO_Pos)        /* (OSCCTRL_STATUS) DPLL0 Timeout Mask */
#define OSCCTRL_STATUS_DPLL0TO(value)         (OSCCTRL_STATUS_DPLL0TO_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLL0TO_Pos)) /* Assigment of value for DPLL0TO in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLL1LCKR_Pos          _UINT32_(24)                                         /* (OSCCTRL_STATUS) DPLL1 Lock Rise Position */
#define OSCCTRL_STATUS_DPLL1LCKR_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_DPLL1LCKR_Pos)      /* (OSCCTRL_STATUS) DPLL1 Lock Rise Mask */
#define OSCCTRL_STATUS_DPLL1LCKR(value)       (OSCCTRL_STATUS_DPLL1LCKR_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLL1LCKR_Pos)) /* Assigment of value for DPLL1LCKR in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLL1LCKF_Pos          _UINT32_(25)                                         /* (OSCCTRL_STATUS) DPLL1 Lock Fall Position */
#define OSCCTRL_STATUS_DPLL1LCKF_Msk          (_UINT32_(0x1) << OSCCTRL_STATUS_DPLL1LCKF_Pos)      /* (OSCCTRL_STATUS) DPLL1 Lock Fall Mask */
#define OSCCTRL_STATUS_DPLL1LCKF(value)       (OSCCTRL_STATUS_DPLL1LCKF_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLL1LCKF_Pos)) /* Assigment of value for DPLL1LCKF in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_DPLL1TO_Pos            _UINT32_(26)                                         /* (OSCCTRL_STATUS) DPLL1 Timeout Position */
#define OSCCTRL_STATUS_DPLL1TO_Msk            (_UINT32_(0x1) << OSCCTRL_STATUS_DPLL1TO_Pos)        /* (OSCCTRL_STATUS) DPLL1 Timeout Mask */
#define OSCCTRL_STATUS_DPLL1TO(value)         (OSCCTRL_STATUS_DPLL1TO_Msk & (_UINT32_(value) << OSCCTRL_STATUS_DPLL1TO_Pos)) /* Assigment of value for DPLL1TO in the OSCCTRL_STATUS register */
#define OSCCTRL_STATUS_Msk                    _UINT32_(0x07071F3F)                                 /* (OSCCTRL_STATUS) Register Mask  */

